"""
Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) 

"""
n = int (input('Введите трехзначное число:'))
summa = 0
while n>0:
    a = n%10
    summa = summa+a
    n= n // 10
print(summa)